posts/2023-04-21-os-customization-and-macos.org
#+title: OS Customization and MacOS
#+date: <2023-04-21 10:19>
#+description:
#+filetags: computers linux macos windows

I was an Apple fanboy some years ago. Back then, whenever something was odd on my computer, I was
surely just using it wrong. Nowadays, I see things the other way around: We're not "holding it
wrong", the computer is just defective. Computers should do our bidding, not vice versa. So here's a
bunch of things that I do to my computers to mold them to my way of working.

** Keyboard Layout

I switch constantly between a German and English keyboard layout, and regularly between various
machines. My physical keyboards are German, and my fingers are used to the Windows-default German and
(international) US keyboard layout. These are available by default on Windows and Linux, but MacOS
goes its own way.

However, keyboard layouts on MacOS are saved in relatively simple text files, and can be modified
with relative ease. The process goes like this: Download [[https://software.sil.org/ukelele/][Ukelele (free)]] to create a new keyboard
layout bundle for your base layout[fn:ukelele]. Inside that bundle, there's a /*.keylayout/ file,
which is an XML file that defines the characters that each key-modifier combination produces. I
changed that to create a Windows-like US keyboard layout. And I replaced the keyboard icon with
something sane (not "A") by creating a 256x256 pixel PNG, opening it in Preview, holding alt while
saving to select the ICNS format. Save the keyboard bundle to ~~/Library/Keyboard Layouts~ and
reboot. Then I remove the unremovable default ("A") German layout by selecting another one, then
~plutil -convert xml1 ~/Library/Preferences/com.apple.HIToolbox.plist~, and delete the entry from
~AppleEnabledInputSources~. Now reboot. Almost easy. Almost.

One the one hand, this was quite the ordeal. On the other, I have tried to do this sort of thing on
Windows and Linux before, and for the life of me /could not do it/. So I actually think this is
great!

[fn:ukelele] if there's an easier way to create a keyboard layout bundle, please let me know. I
didn't use ukelele for anything but the bundle creation.

** Keyboard Shortcuts

My main text editor is Emacs, and I am very used to its keyboard shortcuts. Of particular note are
CTRL-A/E for going to the beginning/end of a line, and Alt-B/F for navigating forward/backwards by
word. I have long wanted to use these shortcuts not just in Emacs and readline-enabled terminal
applications, but everywhere else, too. And with MacOS, this is finally possible: Install
[[https://folivora.ai/][BetterTouchTool ($22)]], and create keyboard shortcuts that maps, e.g. Alt-B/F to Alt-←/→. Ideally,
put this in a new activation group that excludes Emacs. It may be necessary to remove the keyboard
character for Alt-B/F from your keyboard layout before this works. I've spent an embarrassing number
of hours trying to get this to work on Windows and Linux, and really got nowhere[fn:autohotkey].
Actually, however, most readline shortcuts such as Ctrl-A/E/B/F/K/Y already work out of the box on
MacOS!

[fn:autohotkey] It occurs to me that it might actually be possible to do something like on Windows
this with [[https://www.autohotkey.com/][AutoHotkey (free)]]. I'll have to try that!

** Mouse Configuration

I generally use a trackpad, and occasionally a traditional mouse for image editing, and have used a
trackball. I find that any one specific device will lead to wrist pain if used constantly, so I
switch it up every now and then. The trackpad and trackball, however, need configuration to be
usable.

After experimenting with many a trackpad device, I have found Apple touch pads the best trackpads on
the market[fn:trackpads]. On MacOS, they lacks a middle mouse click. So I created a trackpad
shortcut in the aforementioned [[https://folivora.ai/][BetterTouchTool ($22)]] to map the middle click on a three-finger tap
(can also be had for free with [[https://github.com/artginzburg/MiddleClick-Ventura][MiddleClick (OSS)]]). For Windows, [[https://magicutilities.net/][Magic Utilities ($17/y)]] provides a
wonderful third-party driver for Apple devices that also supports the three-finger tap. I have not
gotten the Apple touch pad to pair reliably on Linux, and have generally found their touch pad
driver /libinput/ a bit lacking.

My trackball is a Kensington SlimBlade. To scroll, you rotate the ball around its vertical axis.
This is tedious for longer scroll distances, however. But there's an alternative scrolling method
called "button scrolling", where you hold one button on the trackball, and move the ball to scroll.
You need to install the Kensington driver to enable this on Windows and MacOS. Button scrolling is
available on Linux as well using xinput[fn:xinput], but I haven't gotten the setting to stick across
reboots or sleep cycles. So I wrote a background task that checks xinput every five seconds,
which does the trick.

[fn:trackpads] The Logitech T650 is actually not bad, but the drivers are a travesty. Some Wacom
tablets include touch, too, but they palm rejection is abysmal and they don't support gestures.

[fn:xinput] ~xinput set-prop "Kensington Slimblade Trackball" "libinput Scroll Method Enabled" 0, 0, 1 # button scrolling~ \\
~xinput set-prop "Kensington Slimblade Trackball" "libinput Button Scrolling Button" 8 # top-right button~

** Window Management

Frankly, Windows does window management correctly. Win-←/→ moves windows to the left and right edge
of the screen, as does dragging the window to the screen border. Further Win-←/→ then moves the
window to the next half-screen in that direction, even across display boundaries. KDE does this
correctly out of the box as well, Gnome does not do the latter, and it drives me mad. MacOS doesn't
do any of these things. But [[https://rectangleapp.com/][Rectangle (OSS)]] does. Easy fix. (BetterTouchTool can do it, too, but
Rectangle is prettier)

Furthermore, I want Alt-Tab to switch between windows. Again, MacOS is the odd one out, which uses
CMD-Tab to switch between /apps/, now windows. And then there's another shortcut for switching
between windows of the same app, but the shortcut really doesn't work at all on a German keyboard.
Who came up with this nonsense? Anyway, [[https://manytricks.com/witch/][Witch ($14)]] implements window switching properly.

