posts/2023-04-21-os-customization-and-macos.org
** Application Management

In Windows and Linux, I hit the Windows key and start typing to select and start an app. In MacOS,
this is usually Cmd-Space, but BetterTouchTool can map it to a single short Cmd, if you prefer.

More annoying are the various docks and task bars. I always shove the dock off to the right edge of
the screen, where it stays out of the way. Windows 10 had a sane dock, but then 11 came and forced
it to the bottom of the screen. Dear OS makers, every modern screen has plenty of horizontal space.
But vertical space is somewhat limited. So why on earth would you make a rarely used menu such as
the dock consume that precious vertical space by default? And Microsoft, specifically, /why not make
it movable/? Thankfully, there's [[https://www.startallback.com/][StartAllBack ($5)]], which replaces the Windows task bar with
something sensible, and additionally cleans up the start menu if you so desire. On KDE, I
fractionally prefer [[https://github.com/KDE/latte-dock][Latte (OSS)]] over KDE's native dock. The MacOS dock is uniquely dumb, offering no
start menu, and allowing no window selections. But it's unobtrusive and can be moved to the right
edge, so it's not much of a bother.

** File Management

One of the most crucial tasks in computer work in general is file management. I am not satisfied
with most file managers. Dolphin on KDE works pretty well, it has tabs, can bulk-rename files, can
display large directories without crashing, and updates in real time when new files are added to the
current directory. Gnome Nautilus is so bad it is the main reason I switched to KDE on my Linux
machines. Finder on MacOS is passable, I suppose, although the left sidebar is unnecessarily
restrictive (why can't I add a shortcut to a network drive?). Windows Explorer is really rather
terrible, lacking a bulk-rename tool, and crucially, tabs. In Windows 10, these can be added with
[[https://www.stardock.com/products/groupy/][Groupy ($12)]] (set it to only apply to explorer.exe). Windows 11 has very recently added native tabs,
which work OK, but can't be detached from the window.

The sad thing is that there are plenty of very good file manager replacements out there, but none of
the OSs have a mechanism for replacing their native file manager in a consistent way, so we're
mostly stuck with the defaults.

Oh, and I always remove the iCloud/OneDrive sidebar entries, which is [[https://www.howtogeek.com/225973/how-to-disable-onedrive-and-remove-it-from-file-explorer-on-windows-10/][surprisingly tedious]] on
Windows.

** Hardware Control

On laptops, you can control screen brightness from your keyboard. On desktops, you can not. However,
some clever hackers have put together [[https://github.com/waydabber/BetterDisplay#readme][BetterDisplay (OSS for screen brightness)]], which adds this
capability to MacOS. That's actually a capability I have wanted for quite a while, and apparently it
is only available in MacOS. Great stuff!

Less great is that MacOS does not allow volume control on external sound cards. [[https://rogueamoeba.com/soundsource/][SoundSource ($47)]]
adds this rather crucial functionality back, once you go through the unnecessarily excruciating
process of enabling custom kernel extensions. Windows and Linux of course natively support this.

Another necessary functionality for me is access to a non-sucky (i.e. no FAT) cross-platform file
system. At the moment, the most portable file system seems to be NTFS, of all things. Regrettably,
MacOS only supports /reading/ NTFS, but no writing. [[https://www.paragon-software.com/home/ntfs-mac/#][Paragon NTFS (€20)]] adds this with another kernel
extension, and promptly kernel-panicked my computer. Oh joy. At least it's only panicking for file
transfers initiated by DigiKam, which I can work around. Paragon Support says they're working on it.
I'm not holding my breath. Windows and Linux of course natively support NTFS.

** System Management

I have learned from experience not to trust graphical backup programs. TimeMachine in particular has
eaten my backups many times already, and can not be trusted. But I have used [[https://www.borgbackup.org/][Borg (OSS)]] for years,
and it has so far performed flawlessly. Even more impressive, my Borg backups have a continuous
history despite moving operating systems several times. It truly is wonderful software!

On Windows, I run Borg inside the WSL, and schedule its backups with the Windows Task Scheduler. On
Linux, I schedule them with systemd units. On MacOS, I install Borg with [[https://brew.sh/][Homebrew (OSS)]] and schedule
the backups with launchd tasks. It's all pretty equivalent. One nice thing about launchd, however,
is how the OS immediately pops up a notification if there's a new task file added, and adds the task
to the graphical system settings.

I have to emphasize what a game-changer the WSL is on Windows. Where previously, such simple
automations where a pain in the neck to do reliably, they're now the same simple shell scripts as on
other OSes. And it perfectly integrates with Windows programs as well, including passing pipes
between Linux and Windows programs. It's truly amazing! At the moment, I'd rate Windows a better
Unix system than MacOS for this reason. Homebrew is a passable package manager on MacOS, but the way
it's ill-integrated into the main system (not in system PATH) is a bit off-putting.

